---
kind: enumMember
id: F:Autodesk.Revit.DB.Electrical.ElectricalCircuitPathMode.Custom
enum: Autodesk.Revit.DB.Electrical.ElectricalCircuitPathMode
source: html/ee98a836-6a40-db03-ef1e-655424d04a9a.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalCircuitPathMode.Custom

The circuit path is customized by user.